transformation-library/src/test/resources/locationdetails/dsq.response/success.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">607ae082-0082-4dd7-9962-fc18cc2dc3fe</cais:TrackingId>
    <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">a2a222a0-f433-4ea9-9133-71aa586cbbc8</cais:TransactionId>
    <cais:SessionID xmlns:cais="http://cais-icp.org/v1">fb76f0f829cf44ee9dddfa120b899</cais:SessionID>
  </s:Header>
  <s:Body>
    <PRLO_IN202013CAQC_V01 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <id root="2728d043-8022-42da-b9c4-c314fc584f22"/>
      <creationTime value="20211216190508"/>
      <responseModeCode code="I"/>
      <versionCode code="NE2006"/>
      <interactionId root="2.16.124.10.101.1.60.3.18" extension="PRLO_IN202013CAQC_V01" displayable="true"/>
      <processingCode code="phms"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="senderRoot" extension="senderApplicationId" displayable="true" use="BUS"/>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </receiver>
      <respondTo xsi:nil="true"/>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
          <name>Registre ODS/LDS</name>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id root="d3e7bd23-3f27-4224-a2e5-bf1902021387"/>
        </targetMessage>
      </acknowledgement>
      <controlActEvent classCode="CACT" moodCode="EVN">
        <id root="eventRoot" extension="eventCorrelationId" displayable="true" use="BUS"/>
        <code code="PRLO_TE202013CA"/>
        <statusCode code="completed"/>
        <subject typeCode="SUBJ" contextControlCode="ON" contextConductionInd="true">
          <registrationRequest classCode="REG" moodCode="RQO">
            <statusCode code="active"/>
            <subject typeCode="SBJ" contextControlCode="AN">
              <serviceDeliveryLocation classCode="SDLOC">
                <id root="2.16.840.1.113883.4.273" extension="6000001809" displayable="true"/>
                <code code="RH"/>
                <name>Centre de réadaptation en déficience intellectuelle</name>
                <addr use="PHYS">
                  <streetAddressLine partType="SAL">7843 Rue des Santolines</streetAddressLine>
                  <additionalLocator partType="ADL">QUEBEC, QC</additionalLocator>
                  <city partType="CTY">QUEBEC</city>
                  <postalCode partType="ZIP">G1G0G3</postalCode>
                </addr>
                <statusCode code="NI"/>
                <location classCode="PLC" determinerCode="INSTANCE">
                  <code code="BLDG"/>
                  <mobileInd value="false"/>
                  <asIdentifiedLocation classCode="IDENT">
                    <id extension="21548741" displayable="true"/>
                    <assigningIdentifierOrganization classCode="ORG" determinerCode="INSTANCE">
                      <name>MSSS</name>
                    </assigningIdentifierOrganization>
                  </asIdentifiedLocation>
                </location>
                <serviceProviderOrganization classCode="ORG" determinerCode="INSTANCE">
                  <id root="2.16.840.1.113883.4.274" extension="0" displayable="true"/>
                  <name>null</name>
                </serviceProviderOrganization>
                <directAuthorityOver>
                  <contactParty>
                    <telecom value="6479490254" xsi:nil="true"/>
                  </contactParty>
                </directAuthorityOver>
                <indirectAuthority typeCode="INDAUTH">
                  <territorialAuthority classCode="TERR">
                    <id root="2.16.124.10.101.1.60.1.10" extension="0" displayable="true"/>
                  </territorialAuthority>
                </indirectAuthority>
                <partOf xsi:nil="true"/>
              </serviceDeliveryLocation>
            </subject>
            <custodian typeCode="CST" contextControlCode="AP">
              <assignedDevice classCode="ASSIGNED">
                <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
                <assignedRepository classCode="DEV" determinerCode="INSTANCE">
                  <name>Registre ODS/LDS</name>
                </assignedRepository>
                <representedRepositoryJurisdiction classCode="STATE" determinerCode="INSTANCE">
                  <name>Québec</name>
                </representedRepositoryJurisdiction>
              </assignedDevice>
            </custodian>
          </registrationRequest>
        </subject>
        <queryAck>
          <queryId root="d3e7bd23-3f27-4224-a2e5-bf1902021387"/>
          <queryResponseCode code="OK"/>
          <resultTotalQuantity value="1"/>
          <resultCurrentQuantity value="1"/>
          <resultRemainingQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId root="d3e7bd23-3f27-4224-a2e5-bf1902021387"/>
          <parameterList>
            <recordId>
              <value root="2.16.840.1.113883.4.273" extension="6000001809" displayable="true"/>
            </recordId>
          </parameterList>
        </queryByParameter>
      </controlActEvent>
    </PRLO_IN202013CAQC_V01>
  </s:Body>
</s:Envelope>
